//Пользователь вводит 2 числа. Сообщите, есть ли в написании двух чисел одинаковые цифры.
//Например, для пары 123 и 3456789, ответом будет являться “ДА”, а, для пары 500 и 99 - “НЕТ 
Console.WriteLine("Hello, World!");
