//Пользователь вводит 2 числа. Сообщите, есть ли в написании двух чисел одинаковые цифры.
//Например, для пары 123 и 3456789, ответом будет являться “ДА”, а, для пары 500 и 99 - “НЕТ 

Console.WriteLine("Введите число:");
int numberA = 123;//Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите число:");
int numberB = 34567;//Convert.ToInt32(Console.ReadLine());
