// Пользователь вводит целое положительное число, которое является кубом целого числа N.
// Найдите число N методом половинного деления.
Console.WriteLine("Hello, World!");
