//Пользователь вводит 2 числа (A и B). Возвести число A в степень B.
Console.WriteLine("Введите число А:");
int numberA = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите число В:");
int numberB = Convert.ToInt32(Console.ReadLine());
for()
