// Пользователь вводит 1 положительное число (N). Выведите N-ое число ряда фибоначчи. В ряду фибоначчи каждое следующее число является суммой двух предыдущих. Первое и второе считаются равными 1.

Console.WriteLine("Введите положительное число N");
int numberN = 5;//Convert.ToInt32(Console.ReadLine());
