// Пользователь вводит 1 число (A). Найдите количество положительных целых чисел, квадрат которых меньше A.
Console.WriteLine("Введите число А: ");
int numberA = Convert.ToInt32(Console.ReadLine());
while (true)
{

}

