//Пользователь вводит 2 числа. Найти их наибольший общий делитель используя алгоритм Евклида.
Console.WriteLine("Hello, World!");
